Repository: microsoft/WSL
Catalog: localization/strings/*/Resources.resw
Source language: en_us
Languages: cs_cz, da_dk, de_de, el_gr, es_es, fi_fi, fr_fr, hu_hu, it_it, ja_jp, ko_kr, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ru_ru, sv_se, tr_tr, zh_cn, zh_tw

# MessageEnableVirtualization
source: WSL2 is not supported with your current machine configuration. Please enable the "Virtual Machine Platform" optional component and ensure virtualization is enabled in the BIOS. Enable "Virtual Machine Platform" by running: wsl.exe --install --no-distribution For information please visit https://aka.ms/enablevirtualization
cs_cz: WsL2 se v aktuální konfiguraci vašeho počítače nepodporuje. Povolte volitelnou součást „Platforma virtuálního počítače“ a ujistěte se, že je v systému BIOS povolená virtualizace. Povolte platformu virtuálních počítačů spuštěním příkazu: wsl.exe --install --no-distribution Informace najdete na https://aka.ms/enablevirtualization
da_dk: WSL2 understøttes ikke med den aktuelle maskinkonfiguration. Aktivér den valgfri komponent "Platform til virtuel maskine", og sørg for, at virtualisering er aktiveret i BIOS. Aktivér "Platform til virtuel maskine" ved at køre: wsl.exe --install --no-distribution Du kan få flere oplysninger på https://aka.ms/enablevirtualization
de_de: WSL2 wird von Ihrer aktuellen Computerkonfiguration nicht unterstützt. Aktivieren Sie die optionale Komponente "Plattform für virtuelle Computer", und stellen Sie sicher, dass die Virtualisierung im BIOS aktiviert ist. Aktivieren Sie "Plattform für virtuelle Computer", indem Sie ": wsl.exe --install --no-distribution " ausführen. Weitere Informationen finden Sie unter https://aka.ms/enablevirtualization
el_gr: Το WSL2 δεν μπορεί να ξεκινήσει επειδή η λειτουργία εικονικής μηχανής (virtualization) δεν είναι ενεργοποιημένη σε αυτόν τον υπολογιστή. Παρακαλώ βεβαιωθείτε ότι το προαιρετικό στοιχείο "Πλατφόρμα εικονικής μηχανής" (Virtual Machine Platform) είναι ενεργοποιημένο και ότι η λειτουργία εικονικής μηχανής είναι ενεργοποιημένη στις ρυθμίσεις υλικολογισμικού του υπολογιστή σας. Ενεργοποιήστε την "Πλατφόρμα εικονικής μηχανής" εκτελώντας: wsl.exe --install --no-distribution Για πληροφορίες, επισκεφθείτε τη διεύθυνση https://aka.ms/enablevirtualization
es_es: WSL2 no se puede iniciar porque la virtualización no está habilitada en esta máquina. Asegúrese de que el componente opcional "Plataforma de máquina virtual" esté habilitado y de que la virtualización esté activada en la configuración de firmware del equipo. Habilitar "Plataforma de máquina virtual" ejecutando: wsl.exe --install --no-distribution Para obtener información, visite https://aka.ms/enablevirtualization
fi_fi: WSL2:a ei tueta nykyisessä konekokoonpanossasi. Ota virtuaalikoneympäristön valinnainen osa käyttöön ja varmista, että virtualisointi on otettu käyttöön BIOSissa. Ota virtuaalikoneympäristö käyttöön suorittamalla: wsl.exe --install --no-distribution Lisätietoja on https://aka.ms/enablevirtualization
fr_fr: WSL2 ne peut pas démarrer, car la virtualisation n’est pas activée sur cet ordinateur. Vérifiez que le composant facultatif « Plateforme d’ordinateur virtuel » est activé et que la virtualisation est activée dans les paramètres du microprogramme de votre ordinateur. Activer « Plateforme d’ordinateur virtuel » en exécutant : wsl.exe --install --no-distribution Pour plus d’informations, visitez https://aka.ms/enablevirtualization
hu_hu: A jelenlegi számítógép-konfiguráció nem támogatja a WSL2-t. Engedélyezze a „Virtuálisgép-platform” választható összetevőt, és győződjön meg arról, hogy a virtualizálás engedélyezve van a BIOS-ban. A „Virtuálisgép-platform” engedélyezéséhez futtassa a következőt: wsl.exe --install --no-distribution További információért látogasson el a https://aka.ms/enablevirtualization oldalra
it_it: Impossibile avviare WSL2 perché la virtualizzazione non è abilitata in questo computer. Verificare che il componente facoltativo "Piattaforma macchina virtuale" sia abilitato e che la virtualizzazione sia attivata nelle impostazioni del firmware del computer. Abilitare "Virtual Machine Platform" eseguendo: wsl.exe --install --no-distribution Per informazioni, visitare https://aka.ms/enablevirtualization
ja_jp: このコンピューターで仮想化が有効になっていないため、WSL2 を開始できません。 [仮想マシン プラットフォーム] オプション コンポーネントが有効になっており、コンピューターのファームウェア設定で仮想化がオンになっていることを確認してください。 次のコマンドを実行して [仮想マシン プラットフォーム] を有効にします: wsl.exe --install --no-distribution 詳細については、https://aka.ms/enablevirtualization をご覧ください
ko_kr: 가상화가 활성화되지 않은 이 컴퓨터에서는 WSL2를 시작할 수 없습니다. 컴퓨터의 펌웨어 설정에서 ‘가상 머신 플랫폼’ 선택적 구성 요소가 활성화되고, 가상화가 켜져 있는지 확인하세요. ‘가상 머신 플랫폼’을 활성화기 위해 다음 명령 실행: wsl.exe --install --no-distribution 자세한 내용을 알아보려면 https://aka.ms/enablevirtualization을 방문하세요.
nb_no: WSL2 kan ikke starte fordi virtualisering ikke er aktivert på denne maskinen. Kontroller at den valgfrie komponenten Virtual Machine Platform er aktivert, og at virtualisering er aktivert i datamaskinens fastvareinnstillinger. Aktiver Virtual Machine Platform ved å kjøre: wsl.exe --install --no-distribution Hvis du vil ha mer informasjon, kan du gå til https://aka.ms/enablevirtualization
nl_nl: WSL2 wordt niet ondersteund met de huidige computerconfiguratie. Schakel het optionele onderdeel Virtual Machine Platform in en zorg ervoor dat virtualisatie is ingeschakeld in het BIOS. Schakel Virtual Machine Platform in door uit te voeren: wsl.exe --install --no-distribution Ga naar https://aka.ms/enablevirtualization
pl_pl: Nie można uruchomić protokołu WSL2, ponieważ wirtualizacja nie jest włączona na tej maszynie. Upewnij się, że składnik opcjonalny "Platforma maszyny wirtualnej" jest włączony i że wirtualizacja jest włączona w ustawieniach oprogramowania układowego komputera. Włącz platformę maszyny wirtualnej, uruchamiając polecenie: wsl.exe --install --no-distribution Aby uzyskać informacje, odwiedź https://aka.ms/enablevirtualization
pt_br: O WSL2 não pode ser iniciado porque a virtualização não está habilitada nesta máquina. Verifique se o componente opcional "Plataforma da Máquina Virtual" está habilitado e se a virtualização está ativada nas configurações de firmware do computador. Habilitar a "Plataforma da Máquina Virtual" executando: wsl.exe --install --no-distribution Para obter informações, visite https://aka.ms/enablevirtualization
pt_pt: O WSL2 não é suportado com a configuração atual do computador. Ative o componente opcional "Plataforma de Máquinas Virtuais" e certifique-se de que a virtualização está ativada no BIOS. Ative a "Plataforma de Máquinas Virtuais" executando: wsl.exe --install --no-distribution Para obter informações, visite https://aka.ms/enablevirtualization
ru_ru: Не удалось запустить WSL2, так как на этом компьютере не включена виртуализация. Убедитесь, что дополнительный компонент "Платформа виртуальной машины" включен и виртуализация включена в параметрах встроенного ПО компьютера. Включите "Платформу виртуальной машины", выстроив команду: wsl.exe --install --no-distribution Дополнительные сведения см. в https://aka.ms/enablevirtualization
sv_se: Det går inte att starta WSL2 eftersom virtualisering inte är aktiverat på den här datorn. Kontrollera att den valfria komponenten Virtual Machine Platform är aktiverad och att virtualisering är aktiverat i datorns inställningar för inbyggd programvara. Aktivera Virtual Machine Platform genom att köra: wsl.exe --install --no-distribution Mer information finns på https://aka.ms/enablevirtualization
tr_tr: Sanallaştırma bu makinede etkinleştirilmediği için WSL2 başlatılamıyor. Lütfen "Sanal Makine Platformu" isteğe bağlı bileşeninin etkinleştirildiğinden ve sanallaştırmanın bilgisayarınızın üretici yazılımı ayarlarında açık olduğundan emin olun. "Sanal Makine Platformu" seçeneğini şu komutu çalıştırarak etkinleştirin: wsl.exe --install --no-distribution Bilgi için lütfen şu adresi ziyaret https://aka.ms/enablevirtualization
zh_cn: WSL2 无法启动，因为此计算机上未启用虚拟化。 请确保计算机固件设置中“虚拟机平台”可选组件已启用，且虚拟化已开启。 启用“虚拟机平台”通过运行: wsl.exe --install --no-distribution 有关信息，请访问 https://aka.ms/enablevirtualization
zh_tw: WSL2 無法啟動，因為此機未啟用虛擬化。 請確保您的電腦韌體設定中啟用了「虛擬機平台」這個選用元件，並且虛擬化功能已開啟。 啟用「虛擬機器平台」時，執行： wsl.exe --install --no-distribution 詳情請造訪 https://aka.ms/enablevirtualization

# MessageTooManyDisks
source: Too many virtual hard disks or physical disks are attached.
cs_cz: Je připojeno příliš mnoho virtuálních pevných disků nebo fyzických disků.
da_dk: Der er tilsluttet for mange virtuelle harddiske eller fysiske diske.
de_de: Es sind zu viele virtuelle Festplatten oder physische Datenträger angefügt.
el_gr: Έχουν συνδεθεί πάρα πολλοί εικονικοί ή φυσικοί σκληροί δίσκοι.
es_es: Hay demasiados discos duros virtuales o físicos conectados.
fi_fi: Liian monta virtuaalista tai fyysistä kiintolevyä liitetty.
fr_fr: Trop de disques durs virtuels ou de disques physiques sont attachés.
hu_hu: Túl sok virtuális merevlemez vagy fizikai lemez van csatlakoztatva.
it_it: Sono collegati troppi dischi rigidi virtuali o dischi fisici.
ja_jp: 接続されている仮想ハード ディスクまたは物理ディスクが多すぎます。
ko_kr: 너무 많은 가상 하드 디스크 또는 실제 디스크가 연결되어 있습니다.
nb_no: For mange virtuelle harddisker eller fysiske disker er koblet til.
nl_nl: Er zijn te veel virtuele harde schijven of fysieke schijven gekoppeld.
pl_pl: Dołączono zbyt wiele wirtualnych dysków twardych lub dysków fizycznych.
pt_br: Muitos discos rígidos virtuais ou discos físicos estão anexados.
pt_pt: Existem demasiados discos rígidos virtuais ou discos físicos anexados.
ru_ru: Подключено слишком много виртуальных жестких дисков или физических дисков.
sv_se: För många virtuella hårddiskar eller fysiska diskar är anslutna.
tr_tr: Çok fazla sanal sabit disk veya fiziksel disk bağlı.
zh_cn: 附加的虚拟硬盘或物理磁盘过多。
zh_tw: 連結太多虛擬硬碟或實體磁碟。

# MessageUserVhdAlreadyAttached
source: VHD already mounted via wsl.exe --mount, please unmount the disk before launching.
cs_cz: VHD se už připojil přes wsl.exe --mount, Před spuštěním prosím disk odpojte.
da_dk: VHD er allerede indsat via wsl.exe --mount, afbryd disken, før du starter.
de_de: Die VHD wurde bereits über wsl.exe --mount, bereitgestellt. Heben Sie die Bereitstellung des Datenträgers vor dem Start auf.
el_gr: Το VHD έχει ήδη προσαρτηθεί μέσω του wsl.exe --mount, παρακαλώ αποπροσαρτήστε τον δίσκο πριν από την εκκίνηση.
es_es: VHD ya montado a través de wsl.exe --mount, desmonte el disco antes de iniciarlo.
fi_fi: Virtuaalikiintolevy (VHD) on jo otettu käyttöön komennolla wsl.exe --mount, Poista levy käytöstä ennen käynnistämistä.
fr_fr: VHD déjà monté via wsl.exe --mount, veuillez démonter le disque avant de le lancer.
hu_hu: A virtuális merevlemez már csatlakoztatva van a következővel: wsl.exe --mount, Kérjük, az indítás előtt válassza le a lemezt.
it_it: VHD già montato tramite wsl.exe --mount, smontare il disco prima del lancio.
ja_jp: VHD は wsl.exe --mount, を介して既にマウントされています。起動する前に、ディスクのマウントを解除してください。
ko_kr: VHD가 이미 wsl.exe --mount, 를 통해 마운트되었습니다. 시작하기 전에 디스크를 마운트 해제하세요.
nb_no: VHD-disken er allerede montert via wsl.exe --mount, Demonter disken før du starter.
nl_nl: VHD is al gekoppeld via wsl.exe --mount, Ontkoppel de schijf voordat u start.
pl_pl: Dysk VHD został już zainstalowany za pomocą polecenia wsl.exe --mount, Odinstaluj dysk przed uruchomieniem.
pt_br: VHD já montado via wsl.exe --mount, desmonte o disco antes de iniciar.
pt_pt: O VHD já está montado através de wsl.exe --mount, desmonte o disco antes de iniciar.
ru_ru: VHD уже подключен с помощью команды wsl.exe --mount, отключите диск перед запуском.
sv_se: VHD har redan monterats via wsl.exe --mount, demontera disken innan du startar.
tr_tr: VHD zaten wsl.exe --mount, aracılığıyla bağlandı, lütfen başlatmadan önce diskin bağlantısını kesin.
zh_cn: 已通过 wsl.exe --mount, 装载 VHD，请在启动之前卸载磁盘。
zh_tw: VHD 已透過 wsl.exe --mount, 掛接，請先卸載磁碟再啟動。

# MessageWsl1NotSupported
source: WSL1 is not supported with your current machine configuration. Please enable the "Windows Subsystem for Linux" optional component to use WSL1.
cs_cz: WSL1 se s aktuální konfigurací počítače nepodporuje. Pokud chcete používat WSL1, povolte prosím volitelnou komponentu Subsystém Windows pro Linux.
da_dk: WSL1 understøttes ikke med den aktuelle maskinkonfiguration. Aktivér den valgfrie komponent "Windows-undersystem til Linux" for at bruge WSL1.
de_de: WSL1 wird mit Ihrer aktuellen Computer-Konfiguration nicht unterstützt. Aktivieren Sie bitte die optionale Komponente „Windows Subsystem für Linux“, um WSL1 zu verwenden.
el_gr: Το WSL1 δεν υποστηρίζεται με την τρέχουσα διαμόρφωση του υπολογιστή σας. Παρακαλώ ενεργοποιήστε το προαιρετικό στοιχείο "Υποσύστημα Windows για Linux" για να χρησιμοποιήσετε το WSL1.
es_es: WSL1 no es compatible con la configuración actual del equipo. Habilita el componente opcional "Subsistema de Windows para Linux" para usar WSL1.
fi_fi: WSL1:tä ei tueta nykyisessä tietokoneen kokoonpanossa. Ota valinnainen Windows-alijärjestelmä Linuxille -osa käyttöön, jotta voit käyttää WSL1:tä.
fr_fr: WSL1 n’est pas pris en charge avec votre configuration d’ordinateur actuelle. Veuillez activer le composant facultatif « Windows Subsystem for Linux » pour utiliser WSL1.
hu_hu: A jelenlegi gépkonfiguráció nem támogatja a WSL1-et. A WSL1 használatához engedélyezze a Linuxos Windows-alrendszer választható összetevőt.
it_it: WSL1 non è supportato con la configurazione del computer corrente. Per usare WSL1, è necessario abilitare il componente facoltativo "Sottosistema Windows per Linux".
ja_jp: WSL1 は、現在のマシン構成ではサポートされていません。 WSL1 を使用するには、"Linux 用 Windows サブシステム" オプション コンポーネントを有効にしてください。
ko_kr: 현재 컴퓨터 구성에서는 WSL1이 지원되지 않습니다. WSL1을 사용하려면 "Windows Subsystem for Linux” 선택적 구성 요소를 사용하세요.
nb_no: WSL1 støttes ikke med gjeldende maskinkonfigurasjon. Aktiver den valgfrie Windows-undersystem for Linux-komponenten for å bruke WSL1.
nl_nl: WSL1 wordt niet ondersteund met de huidige computerconfiguratie. Schakel het optionele onderdeel 'Windows Subsystem for Linux' in om WSL1 te gebruiken.
pl_pl: Podsystem WSL1 nie jest obsługiwany w bieżącej konfiguracji komputera. Włącz opcjonalny składnik „Podsystem Windows dla systemu Linux”, aby używać podsystemu WSL1.
pt_br: WSL1 não é compatível com a configuração atual da máquina. Habilite o componente opcional "Windows Subsystem for Linux" para usar WSL1.
pt_pt: O WSL1 não é suportado com a configuração atual do computador. Ative o componente opcional "Subsistema Windows para Linux" para utilizar o WSL1.
ru_ru: Текущая конфигурация компьютера не поддерживает WSL1. Включите необязательный компонент "Подсистема Windows для Linux", чтобы использовать WSL1.
sv_se: WSL1 stöds inte med den aktuella datorkonfigurationen. Aktivera den valfria komponenten "Windows-undersystem för Linux" för att använda WSL1.
tr_tr: WSL1, mevcut makine yapılandırmanızla desteklenmiyor. Lütfen WSL1'i kullanmak için "Windows Subsystem for Linux" isteğe bağlı bileşenini etkinleştirin.
zh_cn: 当前计算机配置不支持 WSL1。 若要使用 WSL1，请启用“Windows Subsystem for Linux”可选组件。
zh_tw: 您目前的電腦設定不支援 WSL1。 請啟用「Windows 子系統 Linux 版」選用元件以使用 WSL1。

# MessageWsl2Needed
source: This operation is only supported by WSL2.
cs_cz: Tuto operaci podporuje jenom WSL2.
da_dk: Denne handling understøttes kun af WSL2.
de_de: Dieser Vorgang wird nur von WSL2 unterstützt.
el_gr: Αυτή η λειτουργία υποστηρίζεται μόνο από το WSL2.
es_es: Esta operación solo es compatible con WSL2.
fi_fi: Vain WSL2 tukee tätä toimintoa.
fr_fr: Cette opération est uniquement prise en charge par WSL2.
hu_hu: Ezt a műveletet csak a WSL2 támogatja.
it_it: Questa operazione è supportata solo da WSL2.
ja_jp: この操作は WSL2 でのみサポートされています。
ko_kr: 이 작업은 WSL2에서만 지원됩니다.
nb_no: Denne operasjonen støttes bare av WSL2.
nl_nl: Deze bewerking wordt alleen ondersteund door WSL2.
pl_pl: Ta operacja jest obsługiwana tylko przez podsystem WSL2.
pt_br: Esta operação só é compatível com WSL2.
pt_pt: Esta operação só é suportada pelo WSL2.
ru_ru: Эта операция поддерживается только в WSL2.
sv_se: Den här åtgärden stöds bara av WSL2.
tr_tr: Bu işlem yalnızca WSL2 tarafından desteklenir.
zh_cn: 仅 WSL2 支持此操作。
zh_tw: 只有 WSL2 支援此作業。

# MessageWslInfoUsage
source: Usage: --networking-mode Display current networking mode. --msal-proxy-path Display the path to the MSAL proxy application. --version Display the version of the WSL package. -n Do not print a newline.
cs_cz: Využití: --networking-mode Zobrazení aktuálního síťového režimu. --msal-proxy-path Zobrazení cesty k aplikaci proxy MSAL. --vm-id Zobrazí ID virtuálního počítače WSL. --version Zobrazí verzi balíčku WSL. -n Netisknout nový řádek.
da_dk: Brug: --networking-mode Vis aktuel netværkstilstand. --msal-proxy-path Vis stien til MSAL-proxyprogrammet. --vm-id Vis WSL VM ID. --version Vis versionen af WSL-pakken. -n Udskriv ikke en ny linje.
de_de: Syntax: --networking-mode Zeigt den aktuellen Netzwerkmodus an. --msal-proxy-path Zeigt den Pfad zur MSAL-Proxyanwendung an. --vm-id Zeigt die WSL-VM-ID an. --version Zeigt die Version des WSL-Pakets an. -n Keinen Zeilenumbruch drucken.
el_gr: Χρήση: --networking-mode Εμφάνιση τρέχουσας λειτουργίας δικτύου. --msal-proxy-path Εμφάνιση της διαδρομής για την εφαρμογή διακομιστή μεσολάβησης MSAL. --vm-id Εμφάνιση του αναγνωριστικού (ID) της εικονικής μηχανής WSL. --version Εμφάνιση της έκδοσης του πακέτου WSL. -n Να μην εκτυπώνεται νέος χαρακτήρας αλλαγής γραμμής.
es_es: Uso: --networking-mode Muestra el modo de red actual. --msal-proxy-path Muestra la ruta de acceso a la aplicación proxy MSAL. --vm-id Muestra el ID de la máquina virtual de WSL. --version Muestra la versión del paquete de WSL. -n No imprima una nueva línea.
fi_fi: Käyttö: --networking-mode Näytä nykyinen verkkotila. --msal-proxy-path Näytä MSAL-välityspalvelinsovelluksen polku. --vm-id Näytä WSL-näennäiskoneen tunnus. --version Näytä WSL-paketin versio. -n Älä tulosta uutta riviä.
fr_fr: Utilisation : --networking-mode Afficher le mode réseau actuel. --msal-proxy-path Affichez le chemin d’accès à l’application proxy MSAL. --vm-id Afficher l’ID de machine virtuelle WSL. --version Affichez la version du package WSL. -n N’imprimez pas de saut de ligne.
hu_hu: Használat: --networking-mode Az aktuális hálózati mód megjelenítése. --msal-proxy-path Az MSAL proxyalkalmazás elérési útjának megjelenítése. --vm-id A WSL VM-azonosítójának megjelenítése. --version A WSL-csomag verziójának megjelenítése. -n Ne nyomtasson új sort.
it_it: Utilizzo: --networking-mode Visualizza la modalità di rete corrente. --msal-proxy-path Visualizza il percorso dell'applicazione proxy MSAL. --vm-id Visualizza l'ID della macchina virtuale WSL. --version Visualizza la versione del pacchetto WSL. -n Non stampa una nuova riga.
ja_jp: 使用: --networking-mode 現在のネットワーク モードを表示します。 --msal-proxy-path MSAL プロキシ アプリケーションへのパスを表示します。 --vm-id WSL VM ID を表示します。 --version WSL パッケージのバージョンを表示します。 -n 改行を出力しません。
ko_kr: 사용량: --networking-mode 현재 네트워킹 모드를 표시합니다. --msal-proxy-path MSAL 프록시 애플리케이션의 경로를 표시합니다. --vm-id WSL VM ID를 표시합니다. --version WSL 패키지의 버전을 표시합니다. -n 줄 바꿈하지 마세요.
nb_no: Bruk: --networking-mode Vis gjeldende nettverksmodus. --msal-proxy-path Vis banen til MSAL-proxyprogrammet. --vm-id Vis VM-ID-en for WSL. --version Vis versjonen av WSL-pakken. -n Ikke skriv ut et linjeskift.
nl_nl: Gebruik: --networking-mode Huidige netwerkmodus weergeven. --msal-proxy-path Geef het pad naar de MSAL-proxytoepassing weer. --vm-id Geef de WSL VM-id weer. --version De versie van het WSL-pakket weergeven. -n Druk geen nieuwe regel af.
pl_pl: Użycie: --networking-mode Wyświetl bieżący tryb sieciowy. --msal-proxy-path Wyświetl ścieżkę do aplikacji serwera proxy MSAL. --vm-id Wyświetl identyfikator maszyny wirtualnej WSL. --version Wyświetl wersję pakietu WSL. -n Nie drukuj nowego wiersza.
pt_br: Uso: --networking-mode Exibir modo de rede atual. --msal-proxy-path Exibir o caminho para o aplicativo proxy MSAL. --vm-id Exibir a ID da VM do WSL. --version Exibir a versão do pacote WSL. -n Não imprima uma nova linha.
pt_pt: Utilização: --networking-mode Exibir o modo de rede atual. --msal-proxy-path Apresentar o caminho para a aplicação proxy MSAL. --vm-id Apresentar o ID de VM WSL. --version Apresentar a versão do pacote WSL. -n Não imprimir uma nova linha.
ru_ru: Использование: --networking-mode Отображение текущего сетевого режима. --msal-proxy-path Отображение пути к прокси-приложению MSAL. --vm-id Отображение ИД виртуальной машины WSL. --version Отображение версии пакета WSL. -n Не печатать новую строку.
sv_se: Användning: --networking-mode Visa aktuellt nätverksläge. --msal-proxy-path Visa sökvägen till MSAL-proxyprogrammet. --vm-id Visa ID för virtuell WSL-dator. --version Visa WSL-paketets version. -n Skriv inte ut en ny rad.
tr_tr: Kullanım: --networking-mode Geçerli ağ modunu görüntüle. --msal-proxy-path MSAL ara sunucu uygulamasının yolunu görüntüle. --vm-id WSL VM kimliğini görüntüle. --version WSL paketinin sürümünü görüntüle. -n Yeni bir satır yazdırma.
zh_cn: 使用量: --networking-mode 显示当前网络模式。 --msal-proxy-path 显示 MSAL 代理应用程序的路径。 --vm-id 显示 WSL VM ID。 --version 显示 WSL 包的版本。 -n 不要打印换行符。
zh_tw: 使用方式: --networking-mode 顯示當前的網路模式。 --msal-proxy-path 顯示 MSAL Proxy 應用程式的路徑。 --vm-id 顯示 WSL 虛擬機器識別碼。 --version 顯示 WSL 套件的版本。 -n 不要列印新行。
